# LinkLoadResult Constructor (LinkLoadResult) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult Constructor (LinkLoadResult)
LinkLoadResult Class See Also
---
Constructs a new copy of the input LinkLoadResult object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LinkLoadResult(
	LinkLoadResult other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As LinkLoadResult _
)
```

Visual C++
---
```text
public:
LinkLoadResult(
	LinkLoadResult^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..LinkLoadResult
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LinkLoadResult Class
LinkLoadResult Overload
Autodesk.Revit.DB Namespace